Autodesk.Revit.DB.PlaneConstraintOptions
Since:
2025
Indicates the plane constraint behaviors.
Since:
2025

Autodesk.Revit.DB.PlaneConstraintOptions.UseNormOrViewPlane
Constrain to either the custom plane or the view plane.

Autodesk.Revit.DB.PlaneConstraintOptions.UseNorm
Constrain to a custom plane.

Autodesk.Revit.DB.PlaneConstraintOptions.UseWorkPlane
Constrain to the work plane

Autodesk.Revit.DB.PlaneConstraintOptions.UseViewPlane
Constrain to the view plane.

Autodesk.Revit.DB.PlaneConstraintOptions.Unset
No constraint.